<?php include("_whatissymfony.php")?>
<div class="column_02">
  <div class="box_title">
    <h1 class="title_01">Почему я должен использовать фреймворк?</h1>
  </div>
  
  <div class="box_article box_introduction">
    <p>
    	Использование фреймворка не обязательно: это "просто" один из инструментов, которые делают разработку лучше и быстрее!
      <br>
      Лучше, потому что фреймворк предоставляет вам уверенность в том, что приложение полностью соответствует бизнес-правилам,
      т.е. оно структурировано, а так же позволяет поддерживать и обновлять код.
      <br>
      Быстрее, потому что позволяет разработчикам использовать готовые модули в своих целях. Более того, без привязки к самому фреймворку.
    </p>
  </div>

  <div class="box_hr"><hr></div>


  <div class="box_article">
    <h2 class="title_09">Работа над задачей, а не над технологией</h2>
    <p>
    Это главный принцип фреймворка: не переизобретайте колесо. И делайте это, забыв о низкоуровневых задачах
    полностью сконцентрировавшись на бизнес-логике.
    </p>
    <p>
    Для примера, фреймворк остерегает разработчика от затраты 2-3 дней на создание формы аутентификации (что не является специфичной задачей).
    Время, которое вы экономите можно направить на разработку специфических компонентов и юнит-тестов; давая вам цельное, устойчивое и высокое
    качество кода.
    </p>
  </div>

  <div class="box_hr"><hr></div>


  <div class="box_article">
    <h2 class="title_09">Гарантированное обновление и поддержка</h2>
    <p>
    В долгосрочной перспективе фреймворк обеспечивает долговечность ваших приложений. Если команда разработчиков работает
    так, как им заблагорассудится, то только этой конкретной группе будет легко поддерживать и обновлять приложение.
    Такое встречается когда издатель поддерживает собственное решение.
    </p>
    <p>
      С другой стороны, фреймворк предоставляет структуру приложения, которая позволяет избежать проблем любому разработчику - 
      принимал он участие в разработке или нет - он может просто "принять" приложение и поддерживать его с течением времени
      и обновлять его быстро и аккуратно, если необходимо.
    </p>
    <p>
      Кроме того, фреймворк не является "черным ящиком". В случае с Symfony это все еще PHP... Разрабатываемые приложения не ограниченны
      вселенной Symfony, они так же <a href="/six-good-reasons#interoperable">поддерживают</a> любую другую PHP-библиотеку.
    </p>
  </div>

  <div class="box_hr"><hr></div>


  <div class="box_page_summary clear_fix">
    <div class="article_illustration"><img src="images/illustration_summary_page.gif" alt="To make a long story short"></div>
    <div class="article_text">
      <p>Использование фреймворка не обязательно, но это очень удобно.</p>
      <p>Фреймворк это залог качества, обновлений и поддержки приложения при низких затратах.</p>
      <p>Приложения, разработанные с использованием фрейворка, совместимы с рыночными стандартами.</p>
    </div>
  </div>
</div>
